{
  "_id": "6696c2ca763f0712c198dac9",
  "video": {
    "ru": "",
    "en": "https://youtu.be/gSrU2k0nOHQ",
    "es": ""
  },
  "content": {
    "ru": "Здесь вы научитесь программировать.\n\nМы будем использовать `JavaScript` – один из самых популярных языков программирования.\n\nЭтот язык программирования используется в различных областях:\n\n– Разработка веб-приложений – `Front-end`\n– Разработка серверных приложений – `Back-end`\n– Автоматизация тестирования `UI` и `API` – `QA Automation`\n– Разработка мобильных приложений – `Mobile Development`\n– Разработка десктопных приложений – `Desktop Development`\n– Разработка игр – `Game Development`\n– Машинное обучение и Искусственный интеллект – `Machine Learning` и `AI`\n\n---\n\n### На кого рассчитан этот курс\n\nМы разработали этот курс для тех, кто хочет научиться программировать с нуля.\n\nПредполагается, что вы не имеете опыта программирования.\n\nЕсли вы уже знаете какой-то язык программирования, то вам будет легче понять материал курса.\n\n\n### Цель курса – научить программировать и подготовить к собеседованию\n\nМы будем решать задачи от простых к сложным и дойдем до задач, которые встречаются на собеседованиях.\n\nЗадача учебной программы – выработать навыки программирования и развить логическое мышление.\n\nВесь материал курса выстроен от простого к сложному. Вы справитесь!\n\n\n\n### Как устроен курс\n\nКурс состоит из последовательных лекций. \n\nВ лекции есть видео, конспект с объяснениями и примерами кода, задачи и тесты.\n\n### Видео\n\nПересмотрите видео, чтобы лучше понять материал.\n\nНекоторые темы стоит пересмотреть несколько раз, чтобы лучше понять.\n\n### Конспект\n\nВ конспекте есть объяснения и примеры кода.\n\nОбратите внимание на примеры кода, попробуйте запустить их и посмотреть, что получится.\n\n### Задачи\n\nВ каждой лекции есть задачи.\n\nЕсли возникают затруднения, то можно посмотреть подсказку.\n\nПосле решения задачи можно посмотреть решение.\n\n### Тесты\n\nВ каждой лекции есть тесты. \n\nВыберите один или несколько правильных ответов.\n\nТест можно пройти cтолько раз, сколько требуется для успешного завершения.\n\n![welcome](https://course-js-syntax.s3-us-west-1.amazonaws.com/js-sandbox.jpg#half)\n\n### Если нужна помощь\n\nВ каждой лекции есть кнопка `🙋 Нужна помощь? Задай вопрос`.\n\nНапшиите свой вопрос и мы постараемся ответить как можно быстрее.\n\n\n* Во время лекции желательно повторять код, показываемый на экране, обращать внимание на код ошибок, возникающих при выполнении программ.\n\nПосле прохождения теста можно увидеть сделанные ошибки, выполнить тест повторно, можно почитать дополнительную информацию и выполнить тест еще раз пересмотреть лекцию для лучшего понимания материала и выполнить тест снова.\n\n\n\n![](https://course-qa-basics.s3.us-west-1.amazonaws.com/trello-.png)\n\n### Научитесь программировать на JavaScript\n\nМы очень надеемся, что во время прохождения курса вы научитесь хорошо писать код и решать задачи, начнете думать и внимательно следить за мелочами.\n\nВнимательно читайте условия задач, их надо выполнять точно так, как описано в условии.\n\n\n\n\n",
    "en": "Here you will learn how to program.\n\nWe will be using `JavaScript`, one of the most popular programming languages.\n\nThis programming language is used in various fields:\n\n– Web application development – `Front-end`\n– Server application development – `Back-end`\n– Testing automation `UI` and `API` – `QA Automation`\n– Mobile application development - `Mobile Development`\n– Desktop application development - `Desktop Development`\n– Game Development `Game Development`\n– Machine Learning and Artificial Intelligence – `Machine Learning` and `AI`\n\n---\n\n### Who this course is designed for\n\nWe developed this course for those who want to learn how to program from scratch.\n\nIt is assumed that you have no programming experience.\n\nIf you already know a programming language, it will be easier for you to understand the course material.\n\n\n### The goal of the course is to teach programming and prepare you for the interview\n\nWe will solve problems from simple to complex and get to the tasks that are encountered in job interviews.\n\nThe goal of the curriculum is to develop programming skills and logical thinking.\n\nThe entire course material is built from the simple to the complex. You can do it!\n\n\n\n### How the course works\n\nThe course consists of consecutive lectures. \n\nThe lecture includes a video, an outline with explanations and code examples, tasks and tests.\n\n### Video\n\nRevisit the video to get a better understanding of the material.\n\nSome topics are worth revisiting several times to better understand.\n\n### Synopsis\n\nThere are explanations and code examples in the outline.\n\nPay attention to the code examples, try running them and see what happens.\n\n### Tasks\n\nEvery lecture has challenges.\n\nIf difficulties arise, you can see a hint.\n\nAfter solving the problem, you can see the solution.\n\n### Tests\n\nThere are tests in every lecture. \n\nChoose one or more correct answers.\n\nYou can take the test as many times as it takes to successfully complete it.\n\n![welcome](https://course-js-syntax.s3-us-west-1.amazonaws.com/js-sandbox.jpg#half)\n\n### If you need help\n\nEvery lecture has a button `🙋 Need help? Ask a question`.\n\nSend us your question and we will try to answer it as quickly as possible.\n\n\n* During the lecture it is desirable to repeat the code shown on the screen, to pay attention to the code of errors that occur during the execution of programs.\n\nAfter passing the test, you can see the mistakes you made, retake the test, you can read more information and retake the test to review the lecture again for a better understanding of the material and retake the test.\n\n\n\n![](https://course-qa-basics.s3.us-west-1.amazonaws.com/trello-.png)\n\n### Learn to program in JavaScript\n\nWe really hope that during the course you will learn how to write code and solve problems well, start thinking and pay attention to details.\n\nCarefully read the conditions of the problems, they must be performed exactly as described in the condition.\n\n\n\n\n",
    "es": "\n"
  }
}