{
  "_id": "635bf77477d032c22e5b3589",
  "video": {
    "ru": "https://youtu.be/6_qdSJ7zinY",
    "en": "https://youtu.be/6_qdSJ7zinY",
    "es": ""
  },
  "content": {
    "ru": "1.\tДля отработки навыков программирования служит **jsbin.com**.\n2.\tНеобходимо оставить открытыми две вкладки: JavaScript и Console.\n3.\tДля установки автоматической нумерации строк щелкните дважды на пустом месте справа от надписи JavaScript во вкладке JavaScript.\n4.\tОткрыть консоль браузера можно разными способами:\n* *1 способ*: откройте Главное меню браузера Google Chrome: в правой части  адресной строки найдите значок «три вертикальные точки» и щелкните левой кнопкой мышки по значку. Выберите пункт **More tools** (Дополнительные инструменты) – **Developer tools** (Ctrl + Shift + I).\n* *2 способ*: щелчок правой кнопкой мыши в любом месте страницы, выбрать пункт меню **Inspect** – открыть вкладку **Console**.\n5.\tДля вывода информации в консоль служит команда **console.log();**.\n6.\tДля быстрого набора команды **console.log();** в jsbin.com,  наберите `cl` и нажмите кнопку `tab` на клавиатуре.\n7.\tДля запуска программы нажмите кнопку **Run** во вкладке Console.\n8.\tЧтобы очистить консоль jsbin, нажмите кнопку **Clear** во вкладке Console.\n9.\tЧтобы очистить консоль браузера, нажмите кнопку (перечеркнутый кружок) во вкладке Console (Developer Tools).\n10.\tДля сохранения и отправки кода служит команда **File - Save snapshot**.\n11. Комментарии очень важны при написании программы. Они описывают то, что происходит внутри программы, так что человеку, смотрящему на исходный код, нетрудно его понять. С помощью комментария вы можете пояснить фрагмент кода. Строка комментария не является командой программы и игнорируется при выполнении программы. Также, если вы хотите, чтобы какие-то строки программы не выполнялись, вы можете закомментировать эти строки.\n11.\tЧтобы закомментировать строку программы, в начале строки поставьте **//**. \n12.\tЧтобы закомментировать несколько строк программы, надо выделить эти строки и нажать сочетание клавиш `ctrl + /` (для Windows) или command+/ (для Mac), либо заключить эти строки в ** /\\* ... \\*/ **.\n\nПример 1. Напечатать в консоли название вашего города.\n```\nconsole.log('Miami');\n```\nПример 2. Напечатать свое имя, затем закомментировать эту строку.\n```\n// console.log('Alice');\n```\nПример 3. Напечатать несколько строк стихотворения.\n```\n// 1 cпособ:\nconsole.log('Let it snow!');\nconsole.log('Let it snow!');\nconsole.log('Let it snow!');\n\n// 2 способ:\nconsole.log('Let it snow!\\nLet it snow!\\nLet it snow!');  //\\n - символ переноса строки\n```\n\n##### Задание для самопроверки №1\n1.\tПовторите действия, показанные в лекции (вывод в консоль фразы «Hello world!»).\n2.\tВыполните программу, нажав кнопку Run.\n3.\tПросмотрите результат в консоли jsbin и в консоли браузера. \n4.\tОчистите консоль jsbin.\n5.\tОчистите консоль браузера.\n6.\tВыполните программу еще раз.\n7.\tДополните программу, добавив команды:\nа)\tкоманду, которая выведет в консоль ваше имя; \nб)\tкоманду, которая выведет в консоль название города, где вы живете. \n8.\tВ начало программы вставьте свои имя и фамилию и закомментируйте эту строку.\n\n##### Задание для самопроверки №2\n* Откройте ссылку и выполните задание:\nhttps://jsbin.com/vovosucohu/edit?js,console\n\n##### Рекомендуем посмотреть \n- https://youtu.be/BY1GNFrofrM Почему Вы должны учиться программированию\n- https://youtu.be/haoTFLjysjk Речь Стива Джобса\n- https://youtu.be/xMYg_GFZFs0 8 Ошибок при изучении JavaScript\n\n##### Рекомендуем почитать\n- https://karmazzin.gitbooks.io/eloquentjavascript_ru/content/ Выразительный JavaScript\n- https://learn.javascript.ru Современный учебник JavaScript\n\nВы видите иконку с зеленой колбой. Это практические задания, которые вы должны выполнить прямо тут.\n\nВсе работает очень просто. Сначала есть описание задачи, и также может быть аналогичный пример того, что нужно сделать.  \n\nВ поле для ввода решения напишите ваш код, потом нажмите кнопку `Validate solution`. Ваше решение будет отправлено на автоматическую проверку. Если все хорошо, то все тесты будут отмечены зеленым, и появится кнопка `Submit solution`. Если на нее нажать, то это решение будет отправлено как финальная версия, и вы перейдете к следующей задаче.  \n\nПерейти к новой задаче можно, только выполнив предыдущую.\n\nВнимательно читайте инструкции и делайте именно так, как требует условие.\nВперед!",
    "en": "1.  **jsbin.com** serves for practicing your programming skills.\n2.  You need to leave two tabs open: JavaScript and Console.\n3.  To set automatic line numbering, double-click the blank space to the right of JavaScript in the JavaScript tab.\n4.  There are a number of ways to open the browser console:\n* *1 way*: open the Main menu of Google Chrome browser: find the \"three vertical dots\" icon on the right side of the address bar and left-click on the icon. Select **More tools** - **Developer tools** (Ctrl + Shift + I).\n* *2 way*: right-click anywhere on the page, select **Inspect** - open **Console** tab.\n5.  The **console.log();** command is used to output the information to the console.\n6.  To quickly type **console.log();** in jsbin.com, type `cl` and press `tab` on your keyboard.\n7.  Click **Run** button in the Console tab to run the program.\n8.  To clear the jsbin console, click **Clear** in the Console tab.\n9.  To clear the Browser Console, click the button (crossed out circle) in the Console (Developer Tools) tab.\n10. The **File - Save snapshot** command is used to save and send the code.\n11. Comments are very important when writing a program. They describe what's going on inside the program, so it's easy for a person looking at the source code to understand it. You can use a comment to explain a piece of code. A comment line is not a program command and is ignored during program execution. Also, if you want some lines of the program not to be executed, you can comment out these lines.\n11. To comment out a program line, put **//** at the beginning of the line. \n12. To comment out several program lines, highlight those lines and press `ctrl + /` (for Windows) or command+/ (for Mac), or enclose those lines in ** /\\* . \\*/ **.\n\nExample 1. Type the name of your city in the console.\n```\nconsole.log('Miami');\n```\nExample 2. Type your name, then comment out this line.\n```\n// console.log('Alice');\n```\nExample 3. Print a few lines of a poem.\n```\n// 1 way:\nconsole.log('Let it snow!');\nconsole.log('Let it snow!');\nconsole.log('Let it snow!');\n\n// 2nd way:\nconsole.log('Let it snow!\\nLet it snow!\\nLet it snow!'); //\\n is a line break character\n```\n\n##### Assignment for self-test #1\n1.  Repeat the actions shown in the lesson (displaying \"Hello world!\" in the console).\n2.  Execute the program by pressing the Run button.\n3.  View the result in the jsbin console and in the browser console. \n4.  Clear the jsbin console.\n5.  Clear the browser console.\n6.  Run the program again.\n7.  Complete the program by adding commands:\na) A command that outputs your name to the console; \nb) a command that displays the name of the city where you live in the console. \n8.  Insert your first and last name at the beginning of the program and comment out this line.\n\n##### Assignment for self-test #2\n* Open the link and complete the task:\nhttps://jsbin.com/vovosucohu/edit?js,console\n\n##### We recommend you to watch \n- https://youtu.be/BY1GNFrofrM Why you should learn to program\n- https://youtu.be/haoTFLjysjk Steve Jobs speech\n- https://youtu.be/xMYg_GFZFs0 8 Mistakes When Studying JavaScript\n\n##### Recommended reading\n- https://karmazzin.gitbooks.io/eloquentjavascript_ru/content/ Expressive JavaScript\n- https://learn.javascript.ru Modern JavaScript Tutorial\n\nYou see an icon with a green flask. These are practical tasks that you have to complete right here.\n\nEverything works very simply. First there is a description of the task, and there may also be a similar example of what needs to be done.  \n\nWrite your code in the solution box, then click the `Validate solution` button. Your solution will be sent for automatic verification. If all is well, all tests will be marked green and a `Submit solution` button will appear. If you click on it, this solution will be sent as the final version and you will move on to the next problem.  \n\nYou can only switch to a new task if you have completed the previous task.\n\nRead the instructions carefully and do exactly as the condition requires.\nGo for it!",
    "es": ""
  }
}