{
  "_id": "6696c2ca763f0712c198dade",
  "video": {
    "ru": "https://youtu.be/6_qdSJ7zinY",
    "en": "",
    "es": ""
  },
  "content": {
    "ru": "![](https://course-qa-basics.s3.us-west-1.amazonaws.com/programmers-and-programs.png)\n\nПрограммы – это инструкции для компьютера.\n\nКомпьютер делает все только по инструкциям и не обладает (пока) способностью самостоятельно принимать решения. Поэтому\nпрограммы – это единственный способ, которым мы можем дать ему команды.\n\nПрограммы состоят из инструкций, которые компьютер выполняет по очереди. Каждая инструкция – это команда, которая говорит компьютеру, что он должен сделать.\n\nНапример, инструкция «вывести на экран текст» говорит компьютеру, что он должен вывести на экран текст, который мы напишем в программе.\n\nПредставим, что у нас есть робот. Он может выполнять только те инструкции, которые мы ему дадим. Какие инструкции мы можем дать роботу?\n\nПример не настоящей программы для робота:\n\n\n1. Сделать `10` шагов вперед\n2. Повернуть налево на `90` градусов\n3. Сделать `5` шагов вперед\n4. Повернуть направо на `90` градусов\n5. Измерить освещенность. Если освещенность меньше `50%`, то включить фонарик\n6. Издать короткий звуковой сигнал \n7. Сделать 5 шагов назад\n\n\nДальше мы будем писать программы для компьютера. Он будет выполнять только то, что мы ему скажем.\n\n\n### Консоль - `console.log()`\n\nЧто такое консоль? Консоль – это место, где компьютер выводит информацию. \n\n`console.log()` - это команда, которая говорит компьютеру, что он должен вывести на экран то, что мы напишем в скобках.\n\nНапример:\n\n```javascript\nconsole.log('Hello, world!');     // Выводится в консоль: \"Hello, world!\"\nconsole.log('My name is Alice');  // Выодится в консоль: \"My name is Alice\"\nconsole.log(123);                 // Выводится в консоль: 123\n```\n\n### Комментарии\n\nЕсли мы хотим, чтобы компьютер, временно, не выполнял какую-то часть кода, то мы можем закомментировать ее.\n\nЧтобы закомментировать строку, нужно поставить перед ней два слэша `//`. \n\nКомпьютер не будет выполнять команды, которые находятся после двух слэшей.\n\nНапример:\n\n```javascript\n//console.log('Hello, world!');    // В консоль ничего не выведется\n//console.log(100);                // В консоль ничего не выведется\n```\n",
    "en": "![](https://course-qa-basics.s3.us-west-1.amazonaws.com/programmers-and-programs.png)\n\nPrograms are instructions for the computer.\n\nThe computer does everything only by instructions and does not (yet) have the ability to make decisions independently. So\nprograms are the only way we can give it commands.\n\nPrograms consist of instructions that the computer executes one at a time. Each instruction is a command that tells the computer what it should do.\n\nFor example, the \"display text\" instruction tells the computer to display the text we will write in the program.\n\nLet's imagine that we have a robot. It can only follow the instructions we give it. What instructions can we give the robot?\n\nAn example of a not real program for a robot:\n\n\n1. Take `10` steps forward\n2. Turn left at `90` degrees\n3. Take `5` steps forward\n4. Turn right at `90` degrees\n5. Measure the illuminance. If the illuminance is less than `50%`, turn on the flashlight\n6. Make a short beep \n7. Take 5 steps backwards\n\n\nNext, we will write programs for the computer. It will only do what we tell it to do.\n\n\n### Console - `console.log()`\n\nWhat is a console? A console is a place where a computer displays information. \n\n`console.log()` is a command that tells the computer that it should display what we will write in brackets.\n\nFor example:\n\n```javascript\nconsole.log('Hello, world!'); // Output to console: \"Hello, world!\"\nconsole.log('My name is Alice'); // Output to console: \"My name is Alice\"\nconsole.log(123); // Displayed in the console: 123\n```\n\n### Comments\n\nIf we want the computer, temporarily, not to execute some part of the code, we can comment it out.\n\nTo comment out a line, put two slashes `//` in front of it. \n\nThe computer will not execute commands that are after two slashes.\n\nFor example:\n\n```javascript\n//console.log('Hello, world!'); // nothing will be displayed in the console\n//console.log(100); // nothing will be displayed in the console\n```\n",
    "es": "\n"
  }
}