{
  "_id": "6696c2ca763f0712c198dade",
  "content": {
    "ru": "![](https://course-qa-basics.s3.us-west-1.amazonaws.com/hello-world.png)\r\n\r\nОдин из самых важных этапов в обучении программированию, тестированию и вообще любой IT-специальности — это практика. А точнее — практика написания кода.\r\n\r\nЧтобы научиться программировать, нужно начать с простых примеров: с коротких строк кода, с базовых команд. И со временем из таких маленьких блоков можно будет собирать что-то более сложное и интересное!\r\n\r\nМы начнём с того, что будем писать код в песочнице — это специальная онлайн-платформа, где можно сразу запускать Python-код прямо в браузере:\r\n\r\n * https://www.jdoodle.com/python3-programming-online\r\n * https://www.programiz.com/python-programming/online-compiler/\r\n\r\nВсё очень просто — никаких лишних кнопок и сложных установок. Просто открываешь сайт и можешь сразу писать код.\r\n\r\n### Почему не использовать сразу полноценный редактор кода?\r\nПрежде чем переходить к профессиональным инструментам, важно понять основы. И в этом поможет простая песочница: она не отвлекает и идеально подходит для первых шагов.\r\n\r\n### Как работает песочница?\r\nПосле открытия сайта ты увидишь:\r\n\r\n- Поле для ввода кода - с левой стороны.\r\n- Результат работы программы - Output - с правой стороны.\r\n- Кнопка - `Run` или `Execute` - для запуска программы.\r\n\r\n## Первая программа на Python\r\n_Наконец-то мы напишем нашу первую строку кода!_\r\n\r\nВ поле для ввода кода напиши:\r\n\r\n```python\r\nprint(\"Hello, world!\")\r\n```\r\n\r\nТеперь нажми на кнопку `Run` (или `Execute`). В окне результата (Output) появится строка:\r\n\r\n```\r\nHello, world!\r\n```\r\n\r\n_**Поздравляем — это твоя первая программа на Python!**_\r\n\r\nА теперь попробуем посчитать.\r\n\r\nPython может выполнять математические действия. Например, сложим два числа:\r\n\r\n```python\r\nprint(3 + 4)\r\n```\r\n\r\nНажми `Run` (или `Execute`), и в окне результата (Output) ты увидишь:\r\n\r\n```\r\n7\r\n```\r\n\r\n### Что делать, если появилась ошибка?\r\n\r\nПесочница не показывает ошибки во время набора кода, как это делают некоторые редакторы. Ты узнаешь об ошибке только после нажатия на `Run` (или `Execute`).\r\n\r\nЕсли вдруг видишь сообщение об ошибке:\r\n- внимательно прочитай его, \r\n- постарайся понять, в чём дело,\r\n- сравни свой код с примером из лекции.\r\n\r\nЕсли всё понятно — супер! Если остались вопросы — не стесняйся возвращаться к этому уроку и пробовать снова.\r\n\r\n### Что дальше?\r\n\r\nТеперь, когда ты написал свою первую программу на Python, самое время закрепить знания на практике.\r\n\r\nВ следующем шаге тебя ждут:\r\n - короткий тест по материалу этой лекции, \r\n - и твои первые задачи — простые, но важные упражнения, которые помогут тебе почувствовать себя настоящим программистом!",
    "en": "Here you will learn how to program.\r\n\r\nWe will use `Python` - one of the most popular programming languages."
  }
}