{
  "_id": "6696c2ca763f0712c198db00",
  "content": {
    "ru": "![](https://course-qa-basics.s3.us-west-1.amazonaws.com/hello-world.png)\n\nОчень важный процесс в обучении на программиста, тестировщика и всех других\n\"айтишников\" - это практика, а если точнее — практика кодинга.\n\n\nДля того чтобы научиться программировать, нужно начинать практиковаться с маленьких кусочков кода, с самых простых программ и инструкций, а потом из этого можно сложить что-то большое, сложное и самое главное — интересное!\n\nМы начнем нашу практику написания кода в `песочнице` <https://play.localcoding.us/> — это онлайн-среда для написания кода, которая позволяет нам писать код прямо в браузере, не устанавливая никаких программ на компьютер.\n\nТам всё очень просто: без лишних кнопок, рекламы и всего остального, что может вас отвлечь.\n\n\nНо почему сразу не начать писать код в редакторе? Прежде чем освоить более сложные инструменты, нам нужно освоить азы, или по-другому — разобраться как писать простые программы. Для этого мы и будем использовать \"песочницу\".\n\n\nНо как работает `песочница`? Всё очень просто.\n\nКак только вы откроете страницу, на своём экране вы увидите кнопку `Run`, а выше кнопки — строка с номером `1`.\n\nДля работы с `песочницей` мы будем использовать браузер `Chrome` в паре с набором встроенных в браузер инструментов — Developer tools (сокращенно dev.tools).\n\nНе пугайтесь, сейчас я расскажу, как открыть эти инструменты и как их использовать.\n\nВ браузере, в верхнем правом углу вы найдёте три точки. Кликните на них и найдите опцию `More Tools` (Дополнительные Инструменты).\n\nВ самом низу этой опции вы найдёте `Developer tools` (Инструменты Разработчика).\n\nТакже обратите внимание, что `dev.tools` можно открыть с помощью комбинации клавиш `Ctrl + Shift + I` (Windows) или `Cmd + Opt + I` (Mac).\n\n`Dev.tools` также можно перемещать. \n\nВнутри `dev.tools`, в правом верхнем углу, кликните на три точки.\n\nВ первой опции `Dock side` вы найдёте варианты расположения `dev.tools` в браузере.\n\nОткройте `dev.tools` и перейдите во вкладку `Console`.\n\nЕсли вы увидите какие-то сообщения в консоли — не беспокойтесь и просто кликните на значок `Clear Console` (значок выглядит как знак Стоп).\n\nОчистить консоль можно так же с помощью \"горячих клавиш\" - для пользователей Windows это `Ctrl + L`, а для пользователей Mac это `Cmd + K`.\n\nДавайте же сделаем то, чего вы так долго ждали - напишем нашу первую команду.\n\nВ строке, напишите\n\n```javascript\nconsole.log('Hello World!'); \n```\n\nКликните на кнопку `Run` и посмотрите на результат в консоли.\n\nТак же, вместо `Hello World!` мы можем получить результат сложения.\n\nВ строке, напишите и запустите:\n\n```javascript\nconsole.log(3 + 4); \n```\n\nКонсоль браузера покажет результат сложения.\n\nПомните, что в `песочнице` нет подсветки ошибок в коде.\n\nЕсли вы сделали ошибку, вы не узнаете о её существовании до тех\nпор, пока не кликните на кнопку `Run` и не посмотрите в консоль браузера.\n\nЕсли же у вас ошибка, внимательно прочитайте\nеё в консоли — там будет подсказка, которую стоит проанализировать вместе со своим кодом.",
    "en": "![](https://course-qa-basics.s3.us-west-1.amazonaws.com/hello-world.png)\n\nA very important process in learning to be a programmer, a tester, or any other\nA very important process in learning to be a programmer, a tester, or any other \"IT person\" is practice, or more precisely, the practice of coding.\n\n\nTo learn how to program, you need to start practicing with small pieces of code, with the simplest programs and instructions, and then from that you can build something big, complex and most importantly - interesting!\n\nWe will begin our code-writing practice in the `sandbox` <https://play.localcoding.us/>, which is an online coding environment that allows us to write code directly in the browser without installing any software on the computer.\n\nIt's very simple: no extra buttons, ads, or anything else that might distract you.\n\n\nBut why not start writing code in an editor right away? Before we can master more complex tools, we need to master the basics, or in other words, figure out how to write simple programs. For this we will use the sandbox.\n\n\nBut how does the `sandbox` work? It's very simple.\n\nAs soon as you open the page, you will see the `Run` button on your screen, and above the button there is a line with the number `1`.\n\nTo work with the `sandbox` we will use the browser `Chrome` paired with a set of built-in browser tools - Developer tools (abbreviated as dev.tools).\n\nDon't be frightened, I will now tell you how to open these tools and how to use them.\n\nIn the browser, in the upper right corner you will find three dots. Click on them and find the `More Tools` option.\n\nAt the very bottom of this option you will find `Developer tools`.\n\nAlso note that `dev.tools` can be opened with the key combination `Ctrl + Shift + I` (Windows) or `Cmd + Opt + I` (Mac).\n\n`Dev.tools` can also be moved. \n\nInside `dev.tools`, in the upper right corner, click on the three dots.\n\nIn the first option `Dock side` you will find options for the location of `dev.tools` in the browser.\n\nOpen `dev.tools` and go to the `Console` tab.\n\nIf you see any messages in the console - do not worry and just click on the `Clear Console` icon (the icon looks like a Stop sign).\n\nYou can also clear the console using the \"hotkeys\" - for Windows users this is `Ctrl + L`, and for Mac users this is `Cmd + K`.\n\nLet's do what you've been waiting for - write our first team.\n\nOn the line, write\n\n```javascript\nconsole.log('Hello World!'); \n```\n\nClick on the `Run` button and look at the result in the console.\n\nAlso, instead of `Hello World!` we can get the result of the addition.\n\nIn the line, write and run:\n\n```javascript\nconsole.log(3 + 4); \n```\n\nThe browser console will show the result of the addition.\n\nRemember that there is no error highlighting in the `sandbox` code.\n\nIf you've made a mistake, you won't know it exists until\nIf you made a mistake, you won't know it exists until you click the `Run` button and look in the browser console.\n\nIf you have an error, read it carefully.\nit in the console - there will be a hint, which is worth analyzing with your code.",
    "es": "# Первая программа Hello World language: es"
  },
  "video": {
    "ru": "https://youtu.be/9SSCoUD3LpQ",
    "en": "",
    "es": ""
  }
}